Revit 2024 API
TypeBinding Constructor
Constructs an empty type binding.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public TypeBinding()
Visual Basic
Public Sub New
Visual C++
public:
TypeBinding()
Remarks
Categories can be set a later time by using the Categories property of this object.
See Also
TypeBinding Class
TypeBinding Overload
Autodesk.Revit.DB Namespace